# SQLITE

In [1]:
import sqlite3

# CREATE DATABASE

In [3]:
#student database will be created in jupyter notebook home
#first connect object
db=sqlite3.connect("student_database.db")

In [4]:
#create cursor object from the connection

cur=db.cursor()

# CREATE TABLE IN STUDENT_DATABASE

In [5]:
cur.execute("create table student(id int primary key,name text,marks int)")

# INSERT DATA IN STUDENT TABLE

In [6]:
cur.execute("insert into student(id,name,marks) values(1,'john',90)")
db.commit()

In [7]:
print(cur.rowcount,"record(s) inserted")

1 record(s) inserted

In [8]:
cur.execute("insert into student(id,name,marks) values(2,'teena',100)")
db.commit()

In [9]:
results=cur.execute("select * from student")
for row in results:
    print (row)

(1, 'john', 90)
(2, 'teena', 100)

In [10]:
cur.execute("insert into student values(3,'andrew',70)")
db.commit()

In [12]:
results=cur.execute("select * from student")
for row in results:
    print(row)

(1, 'john', 90)
(2, 'teena', 100)
(3, 'andrew', 70)

In [13]:
cur.execute("insert into student values(4,'dorsey',56)")
db.commit()

In [14]:
cur.execute("insert into student values(5,'david',45)")
db.commit()

In [15]:
cur.execute("insert into student values(6,'kim',70)")
db.commit()

In [16]:
results=cur.execute("select * from student")

In [17]:
for row in results:
    print(row)

(1, 'john', 90)
(2, 'teena', 100)
(3, 'andrew', 70)
(4, 'dorsey', 56)
(5, 'david', 45)
(6, 'kim', 70)

In [18]:
#multiple record insertion

cur.execute("insert into student values(7,'kiara',75),(8,'jack',94)")
db.commit()
# count of record inserted
print(cur.rowcount,"record(s) inserted")

2 record(s) inserted

In [19]:
results=cur.execute("select * from student")
for row in results:
    print(row)

(1, 'john', 90)
(2, 'teena', 100)
(3, 'andrew', 70)
(4, 'dorsey', 56)
(5, 'david', 45)
(6, 'kim', 70)
(7, 'kiara', 75)
(8, 'jack', 94)

# DATABASE WILL BE CREATED IN THE GIVEN LOCATION

In [20]:
db1=sqlite3.connect("c:/MySQLite_DataBase/studentdb.db")

In [21]:
cur1=db1.cursor()

In [22]:
cur1.execute("create table employee(id int,name text,age int)")

In [23]:
cur1.execute("insert into employee values(1,'melina',32)")
db.commit()

In [24]:
print(cur1.rowcount,"record(s) inserted")

1 record(s) inserted

In [25]:
results=cur1.execute("select * from employee")

In [26]:
for row in results:
    print(row)

(1, 'melina', 32)

working with original---- student database

# ACCESSING DATA STORED IN SQLITE USING PYTHON

In [27]:
results=cur.execute("select * from student")
for i in results:
    print(i)

(1, 'john', 90)
(2, 'teena', 100)
(3, 'andrew', 70)
(4, 'dorsey', 56)
(5, 'david', 45)
(6, 'kim', 70)
(7, 'kiara', 75)
(8, 'jack', 94)

In [28]:
results=cur.execute('select id,name from student')
for i in results:
    print(i)

(1, 'john')
(2, 'teena')
(3, 'andrew')
(4, 'dorsey')
(5, 'david')
(6, 'kim')
(7, 'kiara')
(8, 'jack')

In [29]:
results=cur.execute("select * from student where id=1")
for i in results:
    print(i)

(1, 'john', 90)

In [30]:
results=cur.execute("select * from student where id=2")
for i in results:
    print(i)

(2, 'teena', 100)

In [31]:
results=cur.execute("select * from student where id=5")
for i in results:
    print(i)

(5, 'david', 45)

In [32]:
results=cur.execute("select id,marks from student")
for i in results:
    print(i)

(1, 90)
(2, 100)
(3, 70)
(4, 56)
(5, 45)
(6, 70)
(7, 75)
(8, 94)

In [33]:
results=cur.execute("select * from student limit 3")
for i in results:
    print(i)

(1, 'john', 90)
(2, 'teena', 100)
(3, 'andrew', 70)

In [34]:
results=cur.execute("select name from student where id=2")
for i in results:
    print(i)

('teena',)

In [35]:
results=cur.execute("select marks from student where id=2")
for i in results:
    print(i)

(100,)

In [37]:
results=cur.execute("select marks from student where name='john'")
for i in results:
    print(i)

(90,)

In [38]:
results=cur.execute("select * from student where marks>60 and marks<90")
for i in results:
    print(i)

(3, 'andrew', 70)
(6, 'kim', 70)
(7, 'kiara', 75)

In [39]:
results=cur.execute("select * from student")
for i in results:
    print(i)

(1, 'john', 90)
(2, 'teena', 100)
(3, 'andrew', 70)
(4, 'dorsey', 56)
(5, 'david', 45)
(6, 'kim', 70)
(7, 'kiara', 75)
(8, 'jack', 94)

# ORDER BY CLAUSE

In [42]:
results=cur.execute("select * from student order by name asc")
for i in results:
    print(i)

(3, 'andrew', 70)
(5, 'david', 45)
(4, 'dorsey', 56)
(8, 'jack', 94)
(1, 'john', 90)
(7, 'kiara', 75)
(6, 'kim', 70)
(2, 'teena', 100)

In [43]:
results=cur.execute("select * from student order by name desc")
results.fetchall()

[(2, 'teena', 100),
 (6, 'kim', 70),
 (7, 'kiara', 75),
 (1, 'john', 90),
 (8, 'jack', 94),
 (4, 'dorsey', 56),
 (5, 'david', 45),
 (3, 'andrew', 70)]

# AND OPERATOR

In [44]:
results=cur.execute("select * from student where name='david' and marks=45")
for i in results:
    print(i)

(5, 'david', 45)

In [45]:
results=cur.execute("select * from student where name='david' and marks=68")
for i in results:
    print(i)

In [46]:
results=cur.execute("select * from student where id=2 and marks=70")
for i in results:
    print(i)

# OR OPERATOR

In [47]:
results=cur.execute("select * from student where id=2 or marks=70")
for i in results:
    print(i)

(2, 'teena', 100)
(3, 'andrew', 70)
(6, 'kim', 70)

In [48]:
results=cur.execute("select * from student where id=3 or marks=100")
results.fetchall()

[(2, 'teena', 100), (3, 'andrew', 70)]

In [49]:
results=cur.execute("select * from student where id=2 or marks=70")
for i in results:
    print(i)

(2, 'teena', 100)
(3, 'andrew', 70)
(6, 'kim', 70)

# AGGREGATE FUNCTION

In [50]:
#find minimum marks
results=cur.execute("select min(marks)from student")
for i in results:
    print(i)

(45,)

In [51]:
#find maximun marks
results=cur.execute("select max(marks) from student")
for i in results:
    print(i)

(100,)

In [52]:
#find average marks
results=cur.execute("select avg(marks) from student")
results.fetchone()

(75.0,)

In [55]:
#find sum
results=cur.execute("select sum(marks) from student")
results.fetchone()

(600,)

In [56]:
results=cur.execute("select * from student where marks between 65 and 85")
for i in results:
    print(i)

(3, 'andrew', 70)
(6, 'kim', 70)
(7, 'kiara', 75)

In [57]:
results=cur.execute("select * from student where marks is null")
for i in results:
    print(i)

In [58]:
results=cur.execute("select * from student where marks is not null")
for i in results:
    print(i)

(1, 'john', 90)
(2, 'teena', 100)
(3, 'andrew', 70)
(4, 'dorsey', 56)
(5, 'david', 45)
(6, 'kim', 70)
(7, 'kiara', 75)
(8, 'jack', 94)

# LIKE OPERATOR

In [59]:
results=cur.execute("select * from student where name like 'd%'")
for i in results:
    print(i)

(4, 'dorsey', 56)
(5, 'david', 45)

In [60]:
results=cur.execute("select * from student where name like 'j%'")
for i in results:
    print(i)

(1, 'john', 90)
(8, 'jack', 94)

In [61]:
results=cur.execute("select * from student where name like '_a%'")
for i in results:
    print(i)

(5, 'david', 45)
(8, 'jack', 94)

In [62]:
results=cur.execute("select * from student where name like '%m'")
for i in results:
    print(i)

(6, 'kim', 70)

In [63]:
results=cur.execute("select * from student where name like '%e%'")
for i in results:
    print(i)

(2, 'teena', 100)
(3, 'andrew', 70)
(4, 'dorsey', 56)

In [64]:
results=cur.execute("select * from student")
results.fetchall()

[(1, 'john', 90),
 (2, 'teena', 100),
 (3, 'andrew', 70),
 (4, 'dorsey', 56),
 (5, 'david', 45),
 (6, 'kim', 70),
 (7, 'kiara', 75),
 (8, 'jack', 94)]

In [65]:
#display only 4 letter character
results=cur.execute("select * from student where name like '____'")
for i in results:
    print(i)

(1, 'john', 90)
(8, 'jack', 94)

In [66]:
results=cur.execute("select * from student where marks NOT in (70)")
results.fetchall()

[(1, 'john', 90),
 (2, 'teena', 100),
 (4, 'dorsey', 56),
 (5, 'david', 45),
 (7, 'kiara', 75),
 (8, 'jack', 94)]

In [67]:
results=cur.execute("select * from student where name NOT in ('kim')")
for i in results:
    print(i)

(1, 'john', 90)
(2, 'teena', 100)
(3, 'andrew', 70)
(4, 'dorsey', 56)
(5, 'david', 45)
(7, 'kiara', 75)
(8, 'jack', 94)

# UPDATE RECORD

In [68]:
#update the record
sql="update student set marks=81 where id=4"
cur.execute(sql)

In [69]:
results=cur.execute("select * from student where id=4")
for row in results:
    print(row)

(4, 'dorsey', 81)

In [70]:
results=cur.execute("select * from student")
for row in results:
    print(row)

(1, 'john', 90)
(2, 'teena', 100)
(3, 'andrew', 70)
(4, 'dorsey', 81)
(5, 'david', 45)
(6, 'kim', 70)
(7, 'kiara', 75)
(8, 'jack', 94)

In [71]:
#multiple update record

sql="update student set marks=92 where id in(1,2)"
cur.execute(sql)

In [72]:
results=cur.execute("select * from student")
for row in results:
    print(row)

(1, 'john', 92)
(2, 'teena', 92)
(3, 'andrew', 70)
(4, 'dorsey', 81)
(5, 'david', 45)
(6, 'kim', 70)
(7, 'kiara', 75)
(8, 'jack', 94)

In [73]:
#multiple record update using 'IN'
sql="UPDATE student SET marks =68 WHERE id IN (5,6)"
cur.execute(sql)

#verify if its updated
results=cur.execute("SELECT * from student")
for row in results:
    print(row)

(1, 'john', 92)
(2, 'teena', 92)
(3, 'andrew', 70)
(4, 'dorsey', 81)
(5, 'david', 68)
(6, 'kim', 68)
(7, 'kiara', 75)
(8, 'jack', 94)

# DELETE ANY UNWANTED RECORDS

In [74]:
sql="delete from student where id=6"
cur.execute(sql)

In [75]:
results=cur.execute('select * from student')
results.fetchall()

[(1, 'john', 92),
 (2, 'teena', 92),
 (3, 'andrew', 70),
 (4, 'dorsey', 81),
 (5, 'david', 68),
 (7, 'kiara', 75),
 (8, 'jack', 94)]

In [76]:
sql="delete from student where id=4"
cur.execute(sql)
results=cur.execute('select * from student')
results.fetchall()

[(1, 'john', 92),
 (2, 'teena', 92),
 (3, 'andrew', 70),
 (5, 'david', 68),
 (7, 'kiara', 75),
 (8, 'jack', 94)]

# DROP TABLE STUDENT

In [77]:
sql='drop table student'
results=cur.execute(sql)

In [78]:
results=cur.execute('select * from student')
results.fetchall()

OperationalError: no such table: student

In [80]:
db.close()